Revit 2027 API
FamilySymbol.GetFamilyPointLocations Method
Returns the Point Locations for the Family Symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FamilyPointLocation> GetFamilyPointLocations()
Public Function GetFamilyPointLocations As IList(Of FamilyPointLocation)
public:
IList<FamilyPointLocation^>^ GetFamilyPointLocations()
member GetFamilyPointLocations : unit -> IList<FamilyPointLocation>
Return Value
IList<FamilyPointLocation>
Remarks
If a family symbol has point references then their locations are returned by this method, otherwise an empty collection is returned. Examples of FamilySymbol objects that contain point location are Panels and Flexible Components.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace